src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/итСостояниеБлокировкиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>итСостояниеБлокировкиТовара</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.итСостояниеБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ит_ЛогНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_ЛогНСИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеТаблицыTPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Загружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаТранзакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрдерныйЯчеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Comment>Договор по возвратной таре</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
					<Comment>Переработка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Comment>Индивидуальный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяФормаСобственности</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Обособленное подразделение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыТоварныхМарок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыТоварныхМарок</Name>
			<Comment>Виды товарных марок</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Эксклюзивная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стронняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыСезонностиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСезонностиТоваров</Name>
			<Comment>Виды сезонности товаров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВесеннеЛетний</Name>
					<Comment>Весенне-летний товар</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсеннеЗимний</Name>
					<Comment>Осенне-зимний товар</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Всесезонный</Name>
					<Comment>Всесезонный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/итСостояниеБлокировкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>итСостояниеБлокировкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Блокировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разблокировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ЕРПЗагрузкаНСИПерсональный/Ext/Module.bsl
Функция ПолучитьИмяБазыДанных() Экспорт
	Возврат("rarus");
КонецФункции	

Процедура УстановитьЗначениеОрганизация(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	//Цепелев  +++ 2019-11-19-10-24
	//при маппинге в реквизитах склада отсутствует ссылка на организацию
	//реквизитов подрахзделения для текущего склада нет
	//автоматически определить склад и организацию на текущий момент не возможно
	//ЭлементОбъект["Организация"] = Справочники.Организации.НайтиПоКоду("00001");
	ЭлементОбъект["Организация"] = Справочники.Организации.НайтиПоКоду("ЦБ000001");
	//Цепелев  --- 2019-11-19-10-24              
	ЭлементОбъект["ВидСклада"] = Перечисления.ВидыСкладов.Обычный;
		
	ЭлементОбъект["Наименование"] = Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value));

КонецПроцедуры

Процедура УстановитьЗначенияВДоговоре(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	ЭлементОбъект["ВидДоговора"] = Перечисления.ВидыДоговоров.Покупка;
	ЭлементОбъект["ВидОплаты"] = Перечисления.ВидыОплаты.БезналичныйРасчет;

КонецПроцедуры

Процедура УстановитьЗначенияВКонтрагенте(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	ЭлементОбъект["ВидКонтрагента"] = Перечисления.ВидыКонтрагентов.Поставщик;
	ЭлементОбъект["ФормаСобственности"] = Перечисления.ФормыСобственности.Прочее;

КонецПроцедуры

Процедура УстановитьЗначениеФИО(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	Стр = Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value));
	ЭлементОбъект["Наименование"] = Стр;
	Стр = СтрЗаменить(Стр," ",Символы.ПС);
	Если ЗначениеЗаполнено(Стр) тогда
		ЭлементОбъект["Фамилия"] = СтрПолучитьСтроку(Стр,1);
	КонецЕсли;
	Если СтрЧислоВхождений(Стр,Символы.ПС)>=1 тогда		
		ЭлементОбъект["Имя"] = СтрПолучитьСтроку(Стр,2);
	КонецЕсли;
	Если СтрЧислоВхождений(Стр,Символы.ПС)>=2 тогда  		
		ЭлементОбъект["Отчество"] = СтрПолучитьСтроку(Стр,3);
	КонецЕсли;
	
КонецПроцедуры

Процедура ERPПодпискаНаСобытиеПриКопировании(Источник, ОбъектКопирования) Экспорт
	Попытка 
	Источник.ЕРПМастерКлюч = "";
	Источник.ЕРПЗначениеСчетчика = 0;
	Источник.ЕРППризнакНовый = ложь;
	Исключение 
		Сообщить("Нет мастер ключа "+Источник.Ссылка);	
	КонецПопытки;
КонецПроцедуры

Процедура КодКакМастерКлюч(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	Стр = СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value);

	ЭлементОбъект["ЕРПМастерКлюч"] = Стр;
	ЭлементОбъект["Код"] = Стр;

КонецПроцедуры

//Мальцев А.Ю. Актуализация записи в табличную часть, а не в рс  +++
Процедура УстановитьЗначениеКонтактнойИнформации(ЭлементОбъект, Реквизит, RecordSet, ТипКонтактнойИнформации, ВидКонтактнойИнформации, ПолеXML = Ложь) Экспорт
	
	//Добавим представление контактной информации
	отборКонтактов = Новый Структура;
	отборКонтактов.Вставить("Тип",ТипКонтактнойИнформации);
	отборКонтактов.Вставить("Вид",ВидКонтактнойИнформации);
	строкиКонтактнойИнформации = ЭлементОбъект.КонтактнаяИнформация.НайтиСтроки(отборКонтактов);
	Если строкиКонтактнойИнформации.Количество() = 0 Тогда
		строкаКИ = ЭлементОбъект.КонтактнаяИнформация.Добавить();
	Иначе
		строкаКИ = строкиКонтактнойИнформации[0];
	КонецЕсли;	
	
	ЗначениеКИ   			= СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value);	

	строкаКИ.Тип 			= ТипКонтактнойИнформации;
	строкаКИ.Вид 			= ВидКонтактнойИнформации;		
	
	Если Не ПолеXML Тогда
		строкаКИ.Представление 	= ЗначениеКИ;
	Иначе
		строкаКИ.ЗначенияПолей 	= ЗначениеКИ;	
		//Структура НСИ может не соответствовать структуре Есура
		Попытка
			Тест = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(ЗначениеКИ);
		Исключение
			хмлСтрока = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(строкаКИ.Представление, строкаКИ.Вид);
			строкаКИ.ЗначенияПолей 	= хмлСтрока;	
		КонецПопытки;		
	КонецЕсли;
	
КонецПроцедуры

Процедура Удалить_УстановитьЗначениеКонтактнойИнформации(ЭлементОбъект, Реквизит, RecordSet, ТипКонтактнойИнформации, ВидКонтактнойИнформации) Экспорт
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭлементОбъект.Ссылка);
	НаборЗаписей.Отбор.Тип.Установить(ТипКонтактнойИнформации);
	НаборЗаписей.Отбор.Вид.Установить(ВидКонтактнойИнформации);
	НаборЗаписей.Прочитать();
	Стр = СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value);	
	//Если НаборЗаписей.Количество() = 0 и НЕ ЗначениеЗаполнено(Стр) тогда
	//	Возврат;
	//ИначеЕсли НаборЗаписей[0].Представление = Стр тогда
	//	Возврат;
	//КонецЕсли;   	
	
	НаборЗаписей.Очистить();  
	Если ЗначениеЗаполнено(Стр) тогда
		Нов = НаборЗаписей.Добавить();
		Нов.Объект = ЭлементОбъект.Ссылка;
		Нов.Вид = ВидКонтактнойИнформации;
		Нов.Тип = ТипКонтактнойИнформации;
		Нов.Представление = Стр;
	КонецЕсли;
	НаборЗаписей.Записать();
КонецПроцедуры
//Мальцев А.Ю.---

Процедура УстановитьРодителяНоменклатуры(СтруктураПараметров, ЭлементОбъект, Реквизит, RecordSet) Экспорт
            МассивНаименованийРодителей = Новый Массив();
            сч = 1;
            Пока сч <= 5 Цикл
                        Если RecordSet.Fields("NomGroup" + сч).Value <> NULL Тогда
                                    МассивНаименованийРодителей.Добавить(Строка(СокрЛП(RecordSet.Fields("NomGroup" + сч).Value)));
                        КонецЕсли;
                        сч = сч + 1;
            КонецЦикла; 
            
            ПредыдущаяГруппа = Справочники.Номенклатура.ПустаяСсылка();
            ТекущаяГруппа = Справочники.Номенклатура.ПустаяСсылка();
            сч = 0;
            
            Пока сч < МассивНаименованийРодителей.Количество() Цикл
                        ТекущаяГруппа = ПроверитьГруппаСуществует(МассивНаименованийРодителей[сч]);
                        Если ТекущаяГруппа = Неопределено Тогда
                                   ТекущаяГруппа = СоздатьИерархиюГрупп(МассивНаименованийРодителей[сч], ПредыдущаяГруппа);
                        КонецЕсли;    
                        ПредыдущаяГруппа = ТекущаяГруппа;
                        сч = сч + 1;     
            КонецЦикла; 
            
            ЭлементОбъект.Родитель = ТекущаяГруппа;
КонецПроцедуры     
Функция ПроверитьГруппаСуществует(НаименованиеГруппы)
            РезультатДляВозврата = Неопределено;
            
            Запрос = Новый Запрос();
            Запрос.Текст = "ВЫБРАТЬ
                           |       Номенклатура.Ссылка
                           |ИЗ
                           |       Справочник.Номенклатура КАК Номенклатура
                                                  |ГДЕ Номенклатура.ЭтоГруппа
                                                  |И Номенклатура.Наименование = &НаименованиеГруппы";
            Запрос.УстановитьПараметр("НаименованиеГруппы", НаименованиеГруппы);
            Результат = Запрос.Выполнить();
            Если Не Результат.Пустой() Тогда
                        Выборка = Результат.Выбрать();
                        Если Выборка.Следующий() Тогда
                                   РезультатДляВозврата = Выборка.Ссылка;
                        КонецЕсли;    
            КонецЕсли;
            
            Возврат(РезультатДляВозврата);
КонецФункции         
Функция СоздатьИерархиюГрупп(Наименование, Родитель)
            ЭлементОбъект = Справочники.Номенклатура.СоздатьГруппу();
            ID = Новый УникальныйИдентификатор();
            ЭлементОбъект.УстановитьСсылкуНового(Справочники.Номенклатура.ПолучитьСсылку(ID));
            ЭлементОбъект.УстановитьНовыйКод();
            ЭлементОбъект.Родитель = Родитель;
            ЭлементОбъект.Наименование = Наименование;
			Если НЕ ЗначениеЗаполнено(ЭлементОбъект.Артикул) тогда 
				Отказ=Ложь;
				ИТ_ОбщегоНазначения.ОпределитьАртикул(ЭлементОбъект,Отказ);
			КонецЕсли;			
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
            ЭлементОбъект.Записать();
            
            Возврат(ЭлементОбъект.Ссылка);
КонецФункции

Процедура МаппингСтавокНДС(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	Стр = СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value);
	Если Стр = "НДС18" тогда
		//Цепелев  +++ 2019-04-03
		//ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",18);
		ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		//Цепелев  --- 2019-04-03              
	ИначеЕсли Стр = "НДС10" тогда
		ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС10;
	ИначеЕсли Стр = "НДС22" Тогда 
		ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС22;
	ИначеЕсли Стр = "НДС20" Тогда 
		ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	ИначеЕсли Стр = "НДС5" Тогда 
		ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС5;
	ИначеЕсли Стр = "НДС7" Тогда 
		ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС7;

	Иначе
		ЭлементОбъект["СтавкаНДС"] = Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;		                                                   	
КонецПроцедуры

Процедура ГенерацияАртикула(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	Если НЕ ЗначениеЗаполнено(ЭлементОбъект.Артикул) тогда
		Отказ = Ложь;
		ИТ_ОбщегоНазначения.ОпределитьАртикул(ЭлементОбъект,Отказ);
	КонецЕсли;  	
КонецПроцедуры

Функция УстановитьОтборЕслиЕстьВладелец(Наим,ЭлементОбъект, Реквизит, RecordSet) Экспорт
	ЗначениеДляВозврата = ЛОЖЬ;
	Владелец = Строка(СокрЛП(RecordSet.Fields("Owner").Value));
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|       Спр.Ссылка
	|ИЗ
	|       Справочник."+Наим+" КАК Спр
	|ГДЕ
	|       Спр.ЕРПМастерКлюч = &ЕРПМастерКлюч";
	Запрос.УстановитьПараметр("ЕРПМастерКлюч", Владелец);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ЗначениеДляВозврата = ИСТИНА;
	КонецЕсли;             
	Возврат ЗначениеДляВозврата;
КонецФункции         

Функция УстановитьОтборЕстьСправочник(Наим,Справ,RecordSet) Экспорт
	ЗначениеДляВозврата = ЛОЖЬ;
	Владелец = СокрЛП(RecordSet.Fields(Справ).Value);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|       Спр.Ссылка
	|ИЗ
	|       Справочник."+Наим+" КАК Спр
	|ГДЕ
	|       Спр.ЕРПМастерКлюч = &ЕРПМастерКлюч";
	Запрос.УстановитьПараметр("ЕРПМастерКлюч", Владелец);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ЗначениеДляВозврата = ИСТИНА;
	КонецЕсли;             
	Возврат ЗначениеДляВозврата;
КонецФункции

Процедура УстановитьЗначениеЮрФизЛицоКонтрагентов(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	Если Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value)) = "ЮрЛицо" Тогда
		Значение = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	ИначеЕсли Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value)) = "ФизЛицо" Тогда	
		Значение = Перечисления.ФормыСобственности.ЧастноеЛицо;
	ИначеЕсли Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value)) = "ИндивидуальныйПредприниматель" Тогда	
		Значение = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель;
	КонецЕсли;	
	ЭлементОбъект[Реквизит.ИмяРеквизита] = Значение;
КонецПроцедуры	  
Процедура УстановитьЗначениеПодразделение(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	Если НЕ ЗначениеЗаполнено(ЭлементОбъект.Подразделение) Тогда
		ЭлементОбъект.Подразделение = Справочники.ПодразделенияКомпании.НайтиПоНаименованию("ЦМГ");
	КонецЕсли;
КонецПроцедуры
Процедура УстановитьЗначениеПоНаименованию(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	Стр = Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value));
	
	Найден = Справочники.ТоварныеМарки.НайтиПоНаименованию(Стр);
	Если Найден = Неопределено тогда
		Найден = Справочники.ТоварныеМарки.СоздатьЭлемент();
		Найден.Наименование = Стр;
		Найден.ВидТоварнойМарки = Перечисления.ВидыТоварныхМарок.Стронняя;
		Найден.СезонностьТовара = Перечисления.ВидыСезонностиТоваров.Всесезонный;
		Найден.ОбменДанными.Загрузка = Истина;
		Найден.Записать();
		ЭлементОбъект[Реквизит.ИмяРеквизита] = Найден.Ссылка;	
	Иначе
		ЭлементОбъект[Реквизит.ИмяРеквизита] = Найден.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
Процедура ОтказоустойчивыйПоискЕдиницыИзмерения(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	Если НЕ ЗначениеЗаполнено(ЭлементОбъект[Реквизит.ИмяРеквизита]) тогда
		Стр = СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value);
		
		ЕдИзм = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕРПМастерКлюч",Стр,,ЭлементОбъект.Ссылка);
		Если НЕ ЕдИзм.Пустая() тогда
			ЭлементОбъект[Реквизит.ИмяРеквизита] = ЕдИзм;
		Иначе
			ЭлементОбъект[Реквизит.ИмяРеквизита] = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕдиницаПоКлассификатору",ЭлементОбъект.БазоваяЕдиницаИзмерения,,ЭлементОбъект.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//Мальцев А.Ю.+++
Процедура ОтказоустойчивыйПоискЕдиницыИзмеренияПоКодуКлассификатора(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	Стр = СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value);
	ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.НайтиПоРеквизиту("ЕРПМастерКлюч",Стр);
	Если ЗначениеЗаполнено(ЕдиницаПоКлассификатору) Тогда	
		ЭлементОбъект[Реквизит.ИмяРеквизита] = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕдиницаПоКлассификатору",ЕдиницаПоКлассификатору,,ЭлементОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры


//Проверка ЕИ в ШК
Процедура КонтрольЕдиницИзмеренияВШтрихкодах(Номенклатура) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Объект = &Номенклатура
		|	И Штрихкоды.ЕдиницаИзмерения = &ПустаяЕдиница";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ПустаяЕдиница", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			регШК = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
			регШК.Отбор.Объект.Установить(Номенклатура);
			регШК.Отбор.Штрихкод.Установить(ВыборкаДетальныеЗаписи.Штрихкод);
			регШК.Прочитать();
			Для каждого стррегШК из регШК Цикл
				Если ЗначениеЗаполнено(Номенклатура.ОсновнаяЕдиницаИзмерения) И стррегШК.ЕдиницаИзмерения <> Номенклатура.ОсновнаяЕдиницаИзмерения Тогда
			 		стррегШК.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;	
				КонецЕсли;
			КонецЦикла;	
			регШК.Записать();
		КонецЦикла;
			
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработатьФорматыXML(ТекстХМЛ, Номенклатура, НомерСчетчика = 0, ДатаВставки = "", Состояние, ИмяГруппы2 = "") Экспорт
	
	Если ИмяГруппы2 = "2.5 Товары для перепродажи (Сопутствующие)" Тогда
		Возврат;
	КонецЕсли;
		
	МассивСостоянийВвода = Новый Массив;
	МассивСостоянийВвода.Добавить("000000000000003"); //3. К заказу
	МассивСостоянийВвода.Добавить("000000000000004"); //4. К продаже
	МассивСостоянийВвода.Добавить("000000000000005"); //5. К выводу, (начало)
	
	
	МассивСостоянийВывода = Новый Массив;
	МассивСостоянийВывода.Добавить("000000000000006"); //6. К выводу. Распродан
	МассивСостоянийВывода.Добавить("000000000000007"); //7. Заблокирован
	МассивСостоянийВывода.Добавить("000000000000008"); //8. Выведен
	
	СостояниеТоварИМ = "000000000000009"; 			   //9. Товар ИМ
	
	СостояниеБлокировкиНаКассе = Ложь;
	Если Состояние = "000000000000008" Тогда
		СостояниеБлокировкиНаКассе = Истина;
	КонецЕсли;
	
	Если МассивСостоянийВвода.Найти(Состояние) <> НЕОПРЕДЕЛЕНО  ИЛИ МассивСостоянийВывода.Найти(Состояние) <> НЕОПРЕДЕЛЕНО Тогда		
		
		МассивФорматов = Новый Массив;
		
		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(ТекстХМЛ);
			Пока ЧтениеXML.Прочитать() Цикл
				
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
					МассивФорматов.Добавить(ЧтениеXML.Значение)
				КонецЕсли;
				
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФорматыКатегорий.Ссылка КАК Формат,
			|	ПодразделенияКомпании.Ссылка КАК Подразделение
			|ИЗ
			|	Справочник.ФорматыКатегорий КАК ФорматыКатегорий
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
			|		ПО ФорматыКатегорий.Ссылка = ПодразделенияКомпании.ФорматыАссортимента
			|			И (ПодразделенияКомпании.Ссылка В ИЕРАРХИИ (&РабПодразделения))
			|			И (ПодразделенияКомпании.ПометкаУдаления = ЛОЖЬ)
			|ГДЕ
			|	ФорматыКатегорий.ЕРПМастерКлюч В(&МассивФорматов)
			|	И НЕ ПодразделенияКомпании.Ссылка ЕСТЬ NULL
			|ИТОГИ ПО
			|	Формат";
		
		Запрос.УстановитьПараметр("МассивФорматов",   МассивФорматов);
		Запрос.УстановитьПараметр("РабПодразделения", Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаФормат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ДатаВвода = ТекущаяДата();
		Если ЗначениеЗаполнено(ДатаВставки) Тогда
			Попытка
				ДатаВвода = Дата(Лев(ДатаВставки,4) + Сред(ДатаВставки,6,2) + Сред(ДатаВставки,9,2) +  Сред(ДатаВставки,12,2) + Сред(ДатаВставки,15,2)+ Сред(ДатаВставки,18,2));
			Исключение
			КонецПопытки;
		КонецЕсли;		   
			   
		Пока ВыборкаФормат.Следующий() Цикл
			// Вставить обработку выборки ВыборкаФормат	
			
			ВводАссортимента 	  				   = Документы.ИзменениеАссортиментаПодразделения.СоздатьДокумент();	
			ЗаполнитьДокумент 					   = ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ВводАссортимента, НЕОПРЕДЕЛЕНО, "", Истина);
			ВводАссортимента.ДатаВводаВАссортимент = ДатаВвода;
			ВводАссортимента.итФормат 			   = ВыборкаФормат.Формат;
			ВводАссортимента.ЕРПЗначениеСчетчика   = НомерСчетчика;
			Если МассивСостоянийВывода.Найти(Состояние) <> НЕОПРЕДЕЛЕНО Тогда
				ВводАссортимента.ХозОперация = Справочники.ХозОперации.ВыводТоваровИзАссортимента;
			КонецЕсли;				
			
			ВыборкаДетальныеЗаписи = ВыборкаФормат.Выбрать();
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НовПодразделение = ВводАссортимента.Подразделения.Добавить();
				НовПодразделение.ПодразделениеКомпании = ВыборкаДетальныеЗаписи.Подразделение;
						
			КонецЦикла;
			
			Если ВводАссортимента.Подразделения.Количество() Тогда
				
				НовНоменклатура = ВводАссортимента.Товары.Добавить();
				НовНоменклатура.Номенклатура = Номенклатура;
				Документы.ИзменениеАссортиментаПодразделения.ТоварыНоменклатураПриИзменении(ВводАссортимента, НовНоменклатура, НЕОПРЕДЕЛЕНО);
				
				Попытка
					ВводАссортимента.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Ошибка = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации("Авто ввод в ассортимент", УровеньЖурналаРегистрации.Ошибка,,,Ошибка);
				КонецПопытки;
			Иначе
				ЗаписатьТаблицуЛогов(Номенклатура.ЕРПМастерКлюч, НомерСчетчика, "Не найдено ни одного подразделения для формата");
			КонецЕсли;
			
			
		КонецЦикла;

		Попытка
			
			Если СостояниеБлокировкиНаКассе Тогда
				//Устанавливаем блокировку 
				
				ДокументБлокировки 						   = Документы.итБлокировкаТоваровКПродажеНаКассе.СоздатьДокумент();
				ДокументБлокировки.Дата 				   = ТекущаяДата();
				ДокументБлокировки.БлокировкаРазблокировка = Перечисления.итСостояниеБлокировкиТоваров.Блокировка;
				ДокументБлокировки.ХозОперация			   = Справочники.ХозОперации.Блокировка;

				ТекПользователь 						   = ПараметрыСеанса.ТекущийПользователь;
				
				ДокументБлокировки.ПодразделениеКомпании   = ТекПользователь.ПодразделениеКомпании;
				ДокументБлокировки.Организация 			   = ДокументБлокировки.ПодразделениеКомпании.Организация;
				ДокументБлокировки.Автор 				   = ТекПользователь;
				
				НовСтр = ДокументБлокировки.Товары.Добавить();
				НовСтр.Номенклатура = Номенклатура;
				
				ДокументБлокировки.Записать(РежимЗаписиДокумента.Проведение);
				
			Иначе 
				
				//Проверяем, если текущий статус заблокирован, тогда разблокировка
				ТекСостояние = РегистрыСведений.итСостояниеБлокировкиТовара.ПолучитьПоследнее(, Новый Структура("Номенклатура", Номенклатура));
				Если ТекСостояние.Состояние = Перечисления.итСостояниеБлокировкиТоваров.Блокировка И ТекСостояние.СрокДействия > ТекущаяДата() Тогда
					
					ДокументБлокировки 						   = Документы.итБлокировкаТоваровКПродажеНаКассе.СоздатьДокумент();
					ДокументБлокировки.Дата 				   = ТекущаяДата();
					ДокументБлокировки.БлокировкаРазблокировка = Перечисления.итСостояниеБлокировкиТоваров.Разблокировка;
					ДокументБлокировки.ХозОперация			   = Справочники.ХозОперации.Разблокировка;

					ТекПользователь 						   = ПараметрыСеанса.ТекущийПользователь;
					
					ДокументБлокировки.ПодразделениеКомпании   = ТекПользователь.ПодразделениеКомпании;
					ДокументБлокировки.Организация 			   = ДокументБлокировки.ПодразделениеКомпании.Организация;
					ДокументБлокировки.Автор 				   = ТекПользователь;
					
					НовСтр = ДокументБлокировки.Товары.Добавить();
					НовСтр.Номенклатура = Номенклатура;
					
					ДокументБлокировки.Записать(РежимЗаписиДокумента.Проведение);
					
				КонецЕсли;
				
				
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
		
	ИначеЕсли Состояние = СостояниеТоварИМ Тогда	
		
		
		Попытка
			
			//Проверяем, если текущий статус заблокирован, тогда разблокировка
			ТекСостояние = РегистрыСведений.итСостояниеБлокировкиТовара.ПолучитьПоследнее(, Новый Структура("Номенклатура", Номенклатура));
			Если ТекСостояние.Состояние = Перечисления.итСостояниеБлокировкиТоваров.Блокировка И ТекСостояние.СрокДействия > ТекущаяДата() Тогда
				
				ДокументБлокировки 						   = Документы.итБлокировкаТоваровКПродажеНаКассе.СоздатьДокумент();
				ДокументБлокировки.Дата 				   = ТекущаяДата();
				ДокументБлокировки.БлокировкаРазблокировка = Перечисления.итСостояниеБлокировкиТоваров.Разблокировка;
				ДокументБлокировки.ХозОперация			   = Справочники.ХозОперации.Разблокировка;

				ТекПользователь 						   = ПараметрыСеанса.ТекущийПользователь;
				
				ДокументБлокировки.ПодразделениеКомпании   = ТекПользователь.ПодразделениеКомпании;
				ДокументБлокировки.Организация 			   = ДокументБлокировки.ПодразделениеКомпании.Организация;
				ДокументБлокировки.Автор 				   = ТекПользователь;
				
				НовСтр = ДокументБлокировки.Товары.Добавить();
				НовСтр.Номенклатура = Номенклатура;
				
				ДокументБлокировки.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
				
			
		Исключение
			
		КонецПопытки;
		
		
	Иначе
		ЗаписатьТаблицуЛогов(Номенклатура.ЕРПМастерКлюч, НомерСчетчика, "Не установлено состояние ввода или вывода из ассортимента");		
		Возврат;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ЗаписатьТаблицуЛогов(ЕРПМастерКлюч,ЕРПЗначениеСчетчика, ТекстОшибки)
	
	регЛогНСИ = РегистрыСведений.ит_ЛогНСИ.СоздатьМенеджерЗаписи();
	регЛогНСИ.ИмяБазыДанных = "TPI";	
	регЛогНСИ.НаименованиеТаблицыTPI = "dbo.FinishedProducts";
	регЛогНСИ.ЕРПМастерКлюч = ЕРПМастерКлюч;
	регЛогНСИ.ЕРПЗначениеСчетчика = ЕРПЗначениеСчетчика;
	регЛогНСИ.Загружен = Ложь;
	регЛогНСИ.ТекстОшибки = ТекстОшибки;
	регЛогНСИ.ДатаВставки = ТекущаяДата();
	регЛогНСИ.Актуальность = Истина;
	регЛогНСИ.ДатаТранзакции = ТекущаяДата();
			
	Попытка
		регЛогНСИ.Записать(Истина);
	Исключение
			ЗаписьЖурналаРегистрации("ЕРП Загрузка НСИ",УровеньЖурналаРегистрации.Ошибка,,,
			"Не удалось Записать лог "+ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры	


Процедура УстановитьНаправленияТовародвиженийНоменклатуры(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	СтрокаXML = Строка(СокрЛП(RecordSet.Fields("GoodsMovementDirections").Value));
	
	//+++Бойко А.В.+++ 25.08.2022 Задача Битрикс № 148150. Загрузка табличной части Направления товародвижений из TPI
	//Инициализация пустой таблицы значений с мастер ключами направлений тов.движений и наборов состояний
	
	ТаблицаМастерКлючей = Новый ТаблицаЗначений;
	ТаблицаМастерКлючей.Колонки.Добавить("Направление",		ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ТаблицаМастерКлючей.Колонки.Добавить("НаборСостояний",	ОбщегоНазначения.ОписаниеТипаСтрока(15));
		
	Если Не ПустаяСтрока(СтрокаXML) Тогда

		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(СтрокаXML);
			МассивНаправлений = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			ЧтениеXML.Закрыть();
		Исключение
			МассивНаправлений = Новый Массив;
		КонецПопытки;
	
		Если ТипЗнч(МассивНаправлений) = Тип("Массив") Тогда
			Если МассивНаправлений.Количество() > 0 Тогда
			
				//Бойко А. Для записей до 24.08.2022 это будет массив мастер-ключей (строк).
				//А после это будет массив структур. Тип определим по первому элементу.
				ПервыйЭлемент = МассивНаправлений[0];
				
				Если ТипЗнч(ПервыйЭлемент) = Тип("Структура") Тогда
					ТаблицаДанныхTPI = SSL_IT_ОбработкаДанных.МассивСтруктурВТаблицуЗначений(МассивНаправлений);		
					Для Каждого СтрокаТаблицыДанныхTPI Из ТаблицаДанныхTPI Цикл
						SSL_IT_ОбработкаДанных.ДобавитьСтрокуВТаблицуЗначений(ТаблицаМастерКлючей, СтрокаТаблицыДанныхTPI);	
					КонецЦикла; 
				Иначе
					Для Каждого ЭлементЗагрузки Из МассивНаправлений Цикл
						НоваяСтрока = ТаблицаМастерКлючей.Добавить();	
						НоваяСтрока.Направление = ЭлементЗагрузки;
					КонецЦикла; 
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;	
		
	ЭлементОбъект.НаправленияТовародвижений.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаЗагруженныхДанных.Направление,
	               |	ТаблицаЗагруженныхДанных.НаборСостояний
	               |ПОМЕСТИТЬ ТаблицаЗагруженныхДанных
	               |ИЗ
	               |	&ТаблицаЗагруженныхДанных КАК ТаблицаЗагруженныхДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИТ_НаправленияТовародвижений.Ссылка КАК Направление,
	               |	ИТ_НаборыСостояний.Ссылка КАК НаборСостояний
	               |ИЗ
	               |	ТаблицаЗагруженныхДанных КАК ТаблицаЗагруженныхДанных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.итСостояниеНоменклатурыНСИ КАК ИТ_НаборыСостояний
	               |		ПО ТаблицаЗагруженныхДанных.НаборСостояний = ИТ_НаборыСостояний.ЕРПМастерКлюч
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФорматыКатегорий КАК ИТ_НаправленияТовародвижений
	               |		ПО ТаблицаЗагруженныхДанных.Направление = ИТ_НаправленияТовародвижений.ЕРПМастерКлюч";	
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ИТ_НаправленияТовародвижений.Ссылка КАК Направление
		//|ИЗ
		//|	Справочник.ИТ_НаправленияТовародвижений КАК ИТ_НаправленияТовародвижений
		//|ГДЕ
		//|	ИТ_НаправленияТовародвижений.ЕРПМастерКлюч В(&МассивНаправлений)";
	//Запрос.УстановитьПараметр("МассивНаправлений", МассивНаправлений);
	Запрос.УстановитьПараметр("ТаблицаЗагруженныхДанных", ТаблицаМастерКлючей);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНаправлений = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаНаправлений.Следующий() Цикл 
		СтрокаНаправления = ЭлементОбъект.НаправленияТовародвижений.Добавить();	
		СтрокаНаправления.Направление		= ВыборкаНаправлений.Направление;
		СтрокаНаправления.НаборСостояний	= ВыборкаНаправлений.НаборСостояний;
	КонецЦикла;	
	//---Бойко А.В.--- 25.08.2022

КонецПроцедуры	
//Мальцев А.Ю.---


Процедура УстановитьВидимостьЕРП(ЭФормы,ИмяСправочника) Экспорт
	
	Если Не РольДоступна("АбсолютныеПрава") тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЕРПМаппингДляЗагрузкиМаппинг.ИмяРеквизита
		               |ИЗ
		               |	Справочник.ЕРПМаппингДляЗагрузки.Маппинг КАК ЕРПМаппингДляЗагрузкиМаппинг
		               |ГДЕ
		               |	ЕРПМаппингДляЗагрузкиМаппинг.Ссылка.ТипМетаданныхСправочника = &ИмяСправочника
		               |	И НЕ ЕРПМаппингДляЗагрузкиМаппинг.Ссылка.ПометкаУдаления
		               |	И ЕРПМаппингДляЗагрузкиМаппинг.Пометка";
		Запрос.УстановитьПараметр("ИмяСправочника", ИмяСправочника);
		ТаблицаСписокРеквизитов = Запрос.Выполнить().Выгрузить();
		Для каждого тек из ТаблицаСписокРеквизитов Цикл
			Попытка
			ЭФормы[тек.ИмяРеквизита].Доступность = Ложь;
			Исключение КонецПопытки;
		КонецЦикла;	  		
	КонецЕсли;
	
КонецПроцедуры

//Общие
Функция ПолучитьМассивИмен(СтрокаИмен, Разделитель = ",")
	МассивИмен = Новый Массив();
	
	МнСтр = СтрЗаменить(СтрокаИмен,Разделитель,Символы.ПС);
	Для К = 1 По СтрЧислоСтрок(МнСтр) Цикл
		МассивИмен.Добавить(СтрПолучитьСтроку(МнСтр, К));	
	КонецЦикла;	
	
	Возврат(МассивИмен);
КонецФункции	
Функция ПолучитьСсылкуНаЭлементСправочникаПоНаименованию(ИмяСправочника, Наименование) Экспорт
	СсылкаДляВозврата = Справочники[ИмяСправочника].ПустаяСсылка();
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СписокЭлементовСправочника.Ссылка
	               |ИЗ
	               |	Справочник.#ИмяСправочника# КАК СписокЭлементовСправочника
	               |ГДЕ
	               |	СписокЭлементовСправочника.Наименование = &Наименование";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяСправочника#", ИмяСправочника);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			СсылкаДляВозврата = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат(СсылкаДляВозврата);
КонецФункции	
Функция ПолучитьСсылкуНаЭлементСправочникаПоЕРПМастерКлючу(ИмяСправочника, ЕРПМастерКлюч) Экспорт
	СсылкаДляВозврата = Справочники[ИмяСправочника].ПустаяСсылка();
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СписокЭлементовСправочника.Ссылка
	               |ИЗ
	               |	Справочник.#ИмяСправочника# КАК СписокЭлементовСправочника
	               |ГДЕ
	               |	СписокЭлементовСправочника.ЕРПМастерКлюч = &ЕРПМастерКлюч";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяСправочника#", ИмяСправочника);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЕРПМастерКлюч", ЕРПМастерКлюч);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			СсылкаДляВозврата = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаДляВозврата;
КонецФункции	

//Пономаренко А.Ф. 04.12.2017 +++
Процедура УстановитьЗначениеРасписанияТорговойТочки(ЭлементОбъект, Реквизит, RecordSet) Экспорт

	Попытка
		
		ТабличнаяЧасть = ЭлементОбъект[Реквизит.ИмяРеквизита];
		ТабличнаяЧасть.Очистить();
		
		Расписание = Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value));	
		ВыгрузкаТЧ = ТабличнаяЧасть.Выгрузить(); 		
		
		Если ЗначениеЗаполнено(Расписание) Тогда
			
			ЧтениеXML = Новый ЧтениеXML();
			ЧтениеXML.УстановитьСтроку(Расписание);
			ТаблицаЗагрузки = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);	
			
			
			Если ТаблицаЗагрузки.Количество() > 0 Тогда			
				
				Для Индекс = 1 По 7 Цикл
					
					ДеньНедели = Перечисления.ит_ДниНедели.Получить(Индекс-1);
					
					СтруктураОтбора = Новый Структура("НомерДня", Индекс);
					Строки = ТаблицаЗагрузки.НайтиСтроки(СтруктураОтбора);
					
					НоваяСтрока = ТабличнаяЧасть.Добавить();
					НоваяСтрока.ДеньНедели = ДеньНедели;
					
					Если Строки.Количество() = 0 Тогда
						
						НоваяСтрока.ДеньНедели = ДеньНедели;
						
					Иначе    
						
						СтрокаЗагрузки = Строки[0];    					 
						НоваяСтрока.НачалоРаботы = СтрокаЗагрузки.ВремяНачала;
						НоваяСтрока.ОкончаниеРаботы = СтрокаЗагрузки.ВремяОкончания;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("Во время установки рассписания подачи заявок ГП произошла ошибка.", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
		//ТабличнаяЧасть.Загрузить(ВыгрузкаТЧ);
	КонецПопытки
	
КонецПроцедуры	
//Пономаренко А.Ф. 04.12.2017 ---

//Цепелев  +++ 2019-05-20
Функция УстановитьЗначенияШаблонаТорговойТочки(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	ШаблонМастерКлюч = Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value));
	
	ШаблонЭлемент = ит_ОбщегоНазначения.НайтиЭлементПоМастерКлючу("ит_ШаблоныАвтоматическихЗаявок", ШаблонМастерКлюч);
	Возврат ШаблонЭлемент;
	
КонецФункции//Цепелев  --- 2019-05-20   

//Пономаренко А.Ф. 18.05.2018 +++
Процедура УстановитьТабличнуюЧастьШаблонаАвтоЗаявки(ЭлементОбъект, Реквизит, RecordSet) Экспорт
	
	Шаблон = Строка(СокрЛП(RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value)); 
	
	ТабличнаяЧасть = ЭлементОбъект[Реквизит.ИмяРеквизита];
	ВыгрузкаТЧ = ТабличнаяЧасть.Выгрузить();
	
	Попытка 
		
		ТабличнаяЧасть.Очистить();
		
		Если ЗначениеЗаполнено(Шаблон) Тогда
			
			ЧтениеXML = Новый ЧтениеXML();
		    ЧтениеXML.УстановитьСтроку(Шаблон);
		    ТаблицаЗагрузки = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);	
			
			
			
			Для Каждого Строка Из ТаблицаЗагрузки Цикл
				
				Номенклатура = ит_ОбщегоНазначения.НайтиЭлементПоМастерКлючу("Номенклатура", Строка.Номенклатура); 
				
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					НоваяСтрока = ТабличнаяЧасть.Добавить();
					НоваяСтрока.Номенклатура = Номенклатура;
					НоваяСтрока.Количество = Строка.Количество;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		ТабличнаяЧасть.Загрузить(ВыгрузкаТЧ);
	КонецПопытки
	
КонецПроцедуры
